zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_TMR_MEDIA_CHANNEL_GLOBAL.h
/** Number of instances of the TMR_MEDIA_CHANNEL_GLOBAL module. */
#define TMR_MEDIA_CHANNEL_GLOBAL_INSTANCE_COUNT  (1u)

/* TMR_MEDIA_CHANNEL_GLOBAL - Peripheral instance base addresses */
/** Peripheral NETC__TMR_MEDIA_CHANNEL0_GLOBAL base address */
#define IP_NETC__TMR_MEDIA_CHANNEL0_GLOBAL_BASE  (0x6D0F0000u)
/** Peripheral NETC__TMR_MEDIA_CHANNEL0_GLOBAL base pointer */
#define IP_NETC__TMR_MEDIA_CHANNEL0_GLOBAL       ((TMR_MEDIA_CHANNEL_GLOBAL_Type *)IP_NETC__TMR_MEDIA_CHANNEL0_GLOBAL_BASE)
/** Array initializer of TMR_MEDIA_CHANNEL_GLOBAL peripheral base addresses */
#define IP_TMR_MEDIA_CHANNEL_GLOBAL_BASE_ADDRS   { IP_NETC__TMR_MEDIA_CHANNEL0_GLOBAL_BASE }
/** Array initializer of TMR_MEDIA_CHANNEL_GLOBAL peripheral base pointers */
#define IP_TMR_MEDIA_CHANNEL_GLOBAL_BASE_PTRS    { IP_NETC__TMR_MEDIA_CHANNEL0_GLOBAL }

/* ----------------------------------------------------------------------------
   -- TMR_MEDIA_CHANNEL_GLOBAL Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup TMR_MEDIA_CHANNEL_GLOBAL_Register_Masks TMR_MEDIA_CHANNEL_GLOBAL Register Masks
 * @{
 */

/*! @name SMCAPR - Shared memory capability register */
/*! @{ */

#define TMR_MEDIA_CHANNEL_GLOBAL_SMCAPR_NUM_WORDS_MASK (0xFFFFFFU)
#define TMR_MEDIA_CHANNEL_GLOBAL_SMCAPR_NUM_WORDS_SHIFT (0U)
#define TMR_MEDIA_CHANNEL_GLOBAL_SMCAPR_NUM_WORDS_WIDTH (24U)
#define TMR_MEDIA_CHANNEL_GLOBAL_SMCAPR_NUM_WORDS(x) (((uint32_t)(((uint32_t)(x)) << TMR_MEDIA_CHANNEL_GLOBAL_SMCAPR_NUM_WORDS_SHIFT)) & TMR_MEDIA_CHANNEL_GLOBAL_SMCAPR_NUM_WORDS_MASK)
/*! @} */

/*! @name SMDTR - Shared memory depletion threshold register */
/*! @{ */

#define TMR_MEDIA_CHANNEL_GLOBAL_SMDTR_THRESH_MASK (0xFFFFFFU)
#define TMR_MEDIA_CHANNEL_GLOBAL_SMDTR_THRESH_SHIFT (0U)
#define TMR_MEDIA_CHANNEL_GLOBAL_SMDTR_THRESH_WIDTH (24U)
#define TMR_MEDIA_CHANNEL_GLOBAL_SMDTR_THRESH(x) (((uint32_t)(((uint32_t)(x)) << TMR_MEDIA_CHANNEL_GLOBAL_SMDTR_THRESH_SHIFT)) & TMR_MEDIA_CHANNEL_GLOBAL_SMDTR_THRESH_MASK)
/*! @} */

/*! @name SMACR - Shared memory available count register */
/*! @{ */

#define TMR_MEDIA_CHANNEL_GLOBAL_SMACR_COUNT_MASK (0xFFFFFFU)
#define TMR_MEDIA_CHANNEL_GLOBAL_SMACR_COUNT_SHIFT (0U)
#define TMR_MEDIA_CHANNEL_GLOBAL_SMACR_COUNT_WIDTH (24U)
#define TMR_MEDIA_CHANNEL_GLOBAL_SMACR_COUNT(x)  (((uint32_t)(((uint32_t)(x)) << TMR_MEDIA_CHANNEL_GLOBAL_SMACR_COUNT_SHIFT)) & TMR_MEDIA_CHANNEL_GLOBAL_SMACR_COUNT_MASK)
/*! @} */

/*! @name SMCLWMR - Shared memory count low watermark register */
/*! @{ */

#define TMR_MEDIA_CHANNEL_GLOBAL_SMCLWMR_WATERMARK_MASK (0xFFFFFFU)
#define TMR_MEDIA_CHANNEL_GLOBAL_SMCLWMR_WATERMARK_SHIFT (0U)
#define TMR_MEDIA_CHANNEL_GLOBAL_SMCLWMR_WATERMARK_WIDTH (24U)
#define TMR_MEDIA_CHANNEL_GLOBAL_SMCLWMR_WATERMARK(x) (((uint32_t)(((uint32_t)(x)) << TMR_MEDIA_CHANNEL_GLOBAL_SMCLWMR_WATERMARK_SHIFT)) & TMR_MEDIA_CHANNEL_GLOBAL_SMCLWMR_WATERMARK_MASK)
/*! @} */

/*! @name SMBUCR - Shared memory buffer unassigned count register */
/*! @{ */

#define TMR_MEDIA_CHANNEL_GLOBAL_SMBUCR_COUNT_MASK (0xFFFFFFU)
#define TMR_MEDIA_CHANNEL_GLOBAL_SMBUCR_COUNT_SHIFT (0U)
#define TMR_MEDIA_CHANNEL_GLOBAL_SMBUCR_COUNT_WIDTH (24U)
#define TMR_MEDIA_CHANNEL_GLOBAL_SMBUCR_COUNT(x) (((uint32_t)(((uint32_t)(x)) << TMR_MEDIA_CHANNEL_GLOBAL_SMBUCR_COUNT_SHIFT)) & TMR_MEDIA_CHANNEL_GLOBAL_SMBUCR_COUNT_MASK)
/*! @} */

/*! @name SMBUCHWMR - Shared memory buffer unassigned count high watermark register */
/*! @{ */

#define TMR_MEDIA_CHANNEL_GLOBAL_SMBUCHWMR_WATERMARK_MASK (0xFFFFFFU)
#define TMR_MEDIA_CHANNEL_GLOBAL_SMBUCHWMR_WATERMARK_SHIFT (0U)
#define TMR_MEDIA_CHANNEL_GLOBAL_SMBUCHWMR_WATERMARK_WIDTH (24U)
#define TMR_MEDIA_CHANNEL_GLOBAL_SMBUCHWMR_WATERMARK(x) (((uint32_t)(((uint32_t)(x)) << TMR_MEDIA_CHANNEL_GLOBAL_SMBUCHWMR_WATERMARK_SHIFT)) & TMR_MEDIA_CHANNEL_GLOBAL_SMBUCHWMR_WATERMARK_MASK)
/*! @} */

/*! @name SMLCR - Shared memory loss count register */
/*! @{ */

#define TMR_MEDIA_CHANNEL_GLOBAL_SMLCR_COUNT_MASK (0xFFFFFFU)
#define TMR_MEDIA_CHANNEL_GLOBAL_SMLCR_COUNT_SHIFT (0U)
#define TMR_MEDIA_CHANNEL_GLOBAL_SMLCR_COUNT_WIDTH (24U)
#define TMR_MEDIA_CHANNEL_GLOBAL_SMLCR_COUNT(x)  (((uint32_t)(((uint32_t)(x)) << TMR_MEDIA_CHANNEL_GLOBAL_SMLCR_COUNT_SHIFT)) & TMR_MEDIA_CHANNEL_GLOBAL_SMLCR_COUNT_MASK)

#define TMR_MEDIA_CHANNEL_GLOBAL_SMLCR_IFLC_MASK (0x40000000U)
#define TMR_MEDIA_CHANNEL_GLOBAL_SMLCR_IFLC_SHIFT (30U)
#define TMR_MEDIA_CHANNEL_GLOBAL_SMLCR_IFLC_WIDTH (1U)
#define TMR_MEDIA_CHANNEL_GLOBAL_SMLCR_IFLC(x)   (((uint32_t)(((uint32_t)(x)) << TMR_MEDIA_CHANNEL_GLOBAL_SMLCR_IFLC_SHIFT)) & TMR_MEDIA_CHANNEL_GLOBAL_SMLCR_IFLC_MASK)

#define TMR_MEDIA_CHANNEL_GLOBAL_SMLCR_IFDC_MASK (0x80000000U)
#define TMR_MEDIA_CHANNEL_GLOBAL_SMLCR_IFDC_SHIFT (31U)
#define TMR_MEDIA_CHANNEL_GLOBAL_SMLCR_IFDC_WIDTH (1U)
#define TMR_MEDIA_CHANNEL_GLOBAL_SMLCR_IFDC(x)   (((uint32_t)(((uint32_t)(x)) << TMR_MEDIA_CHANNEL_GLOBAL_SMLCR_IFDC_SHIFT)) & TMR_MEDIA_CHANNEL_GLOBAL_SMLCR_IFDC_MASK)
/*! @} */

/*! @name HBTCAPR - Hash bucket table capability register */
/*! @{ */

#define TMR_MEDIA_CHANNEL_GLOBAL_HBTCAPR_NUM_ENTRIES_MASK (0xFFFFU)
#define TMR_MEDIA_CHANNEL_GLOBAL_HBTCAPR_NUM_ENTRIES_SHIFT (0U)
#define TMR_MEDIA_CHANNEL_GLOBAL_HBTCAPR_NUM_ENTRIES_WIDTH (16U)
#define TMR_MEDIA_CHANNEL_GLOBAL_HBTCAPR_NUM_ENTRIES(x) (((uint32_t)(((uint32_t)(x)) << TMR_MEDIA_CHANNEL_GLOBAL_HBTCAPR_NUM_ENTRIES_SHIFT)) & TMR_MEDIA_CHANNEL_GLOBAL_HBTCAPR_NUM_ENTRIES_MASK)

#define TMR_MEDIA_CHANNEL_GLOBAL_HBTCAPR_MAX_COL_MASK (0x7000000U)
#define TMR_MEDIA_CHANNEL_GLOBAL_HBTCAPR_MAX_COL_SHIFT (24U)
#define TMR_MEDIA_CHANNEL_GLOBAL_HBTCAPR_MAX_COL_WIDTH (3U)
#define TMR_MEDIA_CHANNEL_GLOBAL_HBTCAPR_MAX_COL(x) (((uint32_t)(((uint32_t)(x)) << TMR_MEDIA_CHANNEL_GLOBAL_HBTCAPR_MAX_COL_SHIFT)) & TMR_MEDIA_CHANNEL_GLOBAL_HBTCAPR_MAX_COL_MASK)

#define TMR_MEDIA_CHANNEL_GLOBAL_HBTCAPR_MAX_VISITS_MASK (0xF0000000U)
#define TMR_MEDIA_CHANNEL_GLOBAL_HBTCAPR_MAX_VISITS_SHIFT (28U)
#define TMR_MEDIA_CHANNEL_GLOBAL_HBTCAPR_MAX_VISITS_WIDTH (4U)
#define TMR_MEDIA_CHANNEL_GLOBAL_HBTCAPR_MAX_VISITS(x) (((uint32_t)(((uint32_t)(x)) << TMR_MEDIA_CHANNEL_GLOBAL_HBTCAPR_MAX_VISITS_SHIFT)) & TMR_MEDIA_CHANNEL_GLOBAL_HBTCAPR_MAX_VISITS_MASK)
/*! @} */

/*! @name HBTOR0 - Hash bucket table operational register 0 */
/*! @{ */

#define TMR_MEDIA_CHANNEL_GLOBAL_HBTOR0_NUM_ENTRIES_MASK (0xFFFFU)
#define TMR_MEDIA_CHANNEL_GLOBAL_HBTOR0_NUM_ENTRIES_SHIFT (0U)
#define TMR_MEDIA_CHANNEL_GLOBAL_HBTOR0_NUM_ENTRIES_WIDTH (16U)
#define TMR_MEDIA_CHANNEL_GLOBAL_HBTOR0_NUM_ENTRIES(x) (((uint32_t)(((uint32_t)(x)) << TMR_MEDIA_CHANNEL_GLOBAL_HBTOR0_NUM_ENTRIES_SHIFT)) & TMR_MEDIA_CHANNEL_GLOBAL_HBTOR0_NUM_ENTRIES_MASK)

