zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_TMR_MEDIA_CHANNEL_GLOBAL.h
#define TMR_MEDIA_CHANNEL_GLOBAL_RCSBRLHWMR_FRACT_MASK (0xFFU)
#define TMR_MEDIA_CHANNEL_GLOBAL_RCSBRLHWMR_FRACT_SHIFT (0U)
#define TMR_MEDIA_CHANNEL_GLOBAL_RCSBRLHWMR_FRACT_WIDTH (8U)
#define TMR_MEDIA_CHANNEL_GLOBAL_RCSBRLHWMR_FRACT(x) (((uint32_t)(((uint32_t)(x)) << TMR_MEDIA_CHANNEL_GLOBAL_RCSBRLHWMR_FRACT_SHIFT)) & TMR_MEDIA_CHANNEL_GLOBAL_RCSBRLHWMR_FRACT_MASK)

#define TMR_MEDIA_CHANNEL_GLOBAL_RCSBRLHWMR_INT_MASK (0xFFF00U)
#define TMR_MEDIA_CHANNEL_GLOBAL_RCSBRLHWMR_INT_SHIFT (8U)
#define TMR_MEDIA_CHANNEL_GLOBAL_RCSBRLHWMR_INT_WIDTH (12U)
#define TMR_MEDIA_CHANNEL_GLOBAL_RCSBRLHWMR_INT(x) (((uint32_t)(((uint32_t)(x)) << TMR_MEDIA_CHANNEL_GLOBAL_RCSBRLHWMR_INT_SHIFT)) & TMR_MEDIA_CHANNEL_GLOBAL_RCSBRLHWMR_INT_MASK)
/*! @} */

/*! @name RCSBWLAR - Root complex 0 system bus write latency average register */
/*! @{ */

#define TMR_MEDIA_CHANNEL_GLOBAL_RCSBWLAR_FRACT_MASK (0xFFU)
#define TMR_MEDIA_CHANNEL_GLOBAL_RCSBWLAR_FRACT_SHIFT (0U)
#define TMR_MEDIA_CHANNEL_GLOBAL_RCSBWLAR_FRACT_WIDTH (8U)
#define TMR_MEDIA_CHANNEL_GLOBAL_RCSBWLAR_FRACT(x) (((uint32_t)(((uint32_t)(x)) << TMR_MEDIA_CHANNEL_GLOBAL_RCSBWLAR_FRACT_SHIFT)) & TMR_MEDIA_CHANNEL_GLOBAL_RCSBWLAR_FRACT_MASK)

#define TMR_MEDIA_CHANNEL_GLOBAL_RCSBWLAR_INT_MASK (0xFFF00U)
#define TMR_MEDIA_CHANNEL_GLOBAL_RCSBWLAR_INT_SHIFT (8U)
#define TMR_MEDIA_CHANNEL_GLOBAL_RCSBWLAR_INT_WIDTH (12U)
#define TMR_MEDIA_CHANNEL_GLOBAL_RCSBWLAR_INT(x) (((uint32_t)(((uint32_t)(x)) << TMR_MEDIA_CHANNEL_GLOBAL_RCSBWLAR_INT_SHIFT)) & TMR_MEDIA_CHANNEL_GLOBAL_RCSBWLAR_INT_MASK)
/*! @} */

/*! @name RCSBWLHWMR - Root complex 0 system bus write latency high watermark register */
/*! @{ */

#define TMR_MEDIA_CHANNEL_GLOBAL_RCSBWLHWMR_FRACT_MASK (0xFFU)
#define TMR_MEDIA_CHANNEL_GLOBAL_RCSBWLHWMR_FRACT_SHIFT (0U)
#define TMR_MEDIA_CHANNEL_GLOBAL_RCSBWLHWMR_FRACT_WIDTH (8U)
#define TMR_MEDIA_CHANNEL_GLOBAL_RCSBWLHWMR_FRACT(x) (((uint32_t)(((uint32_t)(x)) << TMR_MEDIA_CHANNEL_GLOBAL_RCSBWLHWMR_FRACT_SHIFT)) & TMR_MEDIA_CHANNEL_GLOBAL_RCSBWLHWMR_FRACT_MASK)

#define TMR_MEDIA_CHANNEL_GLOBAL_RCSBWLHWMR_INT_MASK (0xFFF00U)
#define TMR_MEDIA_CHANNEL_GLOBAL_RCSBWLHWMR_INT_SHIFT (8U)
#define TMR_MEDIA_CHANNEL_GLOBAL_RCSBWLHWMR_INT_WIDTH (12U)
#define TMR_MEDIA_CHANNEL_GLOBAL_RCSBWLHWMR_INT(x) (((uint32_t)(((uint32_t)(x)) << TMR_MEDIA_CHANNEL_GLOBAL_RCSBWLHWMR_INT_SHIFT)) & TMR_MEDIA_CHANNEL_GLOBAL_RCSBWLHWMR_INT_MASK)
/*! @} */

/*! @name IPBRR0 - IP block revision register 0 */
/*! @{ */

#define TMR_MEDIA_CHANNEL_GLOBAL_IPBRR0_IP_MN_MASK (0xFFU)
#define TMR_MEDIA_CHANNEL_GLOBAL_IPBRR0_IP_MN_SHIFT (0U)
#define TMR_MEDIA_CHANNEL_GLOBAL_IPBRR0_IP_MN_WIDTH (8U)
#define TMR_MEDIA_CHANNEL_GLOBAL_IPBRR0_IP_MN(x) (((uint32_t)(((uint32_t)(x)) << TMR_MEDIA_CHANNEL_GLOBAL_IPBRR0_IP_MN_SHIFT)) & TMR_MEDIA_CHANNEL_GLOBAL_IPBRR0_IP_MN_MASK)

#define TMR_MEDIA_CHANNEL_GLOBAL_IPBRR0_IP_MJ_MASK (0xFF00U)
#define TMR_MEDIA_CHANNEL_GLOBAL_IPBRR0_IP_MJ_SHIFT (8U)
#define TMR_MEDIA_CHANNEL_GLOBAL_IPBRR0_IP_MJ_WIDTH (8U)
#define TMR_MEDIA_CHANNEL_GLOBAL_IPBRR0_IP_MJ(x) (((uint32_t)(((uint32_t)(x)) << TMR_MEDIA_CHANNEL_GLOBAL_IPBRR0_IP_MJ_SHIFT)) & TMR_MEDIA_CHANNEL_GLOBAL_IPBRR0_IP_MJ_MASK)
/*! @} */

/*! @name IPBRR1 - IP block revision register 1 */
/*! @{ */

#define TMR_MEDIA_CHANNEL_GLOBAL_IPBRR1_IP_CFG_MASK (0xFFU)
#define TMR_MEDIA_CHANNEL_GLOBAL_IPBRR1_IP_CFG_SHIFT (0U)
#define TMR_MEDIA_CHANNEL_GLOBAL_IPBRR1_IP_CFG_WIDTH (8U)
#define TMR_MEDIA_CHANNEL_GLOBAL_IPBRR1_IP_CFG(x) (((uint32_t)(((uint32_t)(x)) << TMR_MEDIA_CHANNEL_GLOBAL_IPBRR1_IP_CFG_SHIFT)) & TMR_MEDIA_CHANNEL_GLOBAL_IPBRR1_IP_CFG_MASK)

#define TMR_MEDIA_CHANNEL_GLOBAL_IPBRR1_IP_MNT_MASK (0xFF00U)
#define TMR_MEDIA_CHANNEL_GLOBAL_IPBRR1_IP_MNT_SHIFT (8U)
#define TMR_MEDIA_CHANNEL_GLOBAL_IPBRR1_IP_MNT_WIDTH (8U)
#define TMR_MEDIA_CHANNEL_GLOBAL_IPBRR1_IP_MNT(x) (((uint32_t)(((uint32_t)(x)) << TMR_MEDIA_CHANNEL_GLOBAL_IPBRR1_IP_MNT_SHIFT)) & TMR_MEDIA_CHANNEL_GLOBAL_IPBRR1_IP_MNT_MASK)

#define TMR_MEDIA_CHANNEL_GLOBAL_IPBRR1_IP_INT_MASK (0xFF0000U)
#define TMR_MEDIA_CHANNEL_GLOBAL_IPBRR1_IP_INT_SHIFT (16U)
#define TMR_MEDIA_CHANNEL_GLOBAL_IPBRR1_IP_INT_WIDTH (8U)
#define TMR_MEDIA_CHANNEL_GLOBAL_IPBRR1_IP_INT(x) (((uint32_t)(((uint32_t)(x)) << TMR_MEDIA_CHANNEL_GLOBAL_IPBRR1_IP_INT_SHIFT)) & TMR_MEDIA_CHANNEL_GLOBAL_IPBRR1_IP_INT_MASK)
/*! @} */

/*! @name FBLPR - Function boot loader parameter register 0..Function boot loader parameter register 1 */
/*! @{ */

#define TMR_MEDIA_CHANNEL_GLOBAL_FBLPR_PARAM_VAL_MASK (0xFFFFFFFFU)
#define TMR_MEDIA_CHANNEL_GLOBAL_FBLPR_PARAM_VAL_SHIFT (0U)
#define TMR_MEDIA_CHANNEL_GLOBAL_FBLPR_PARAM_VAL_WIDTH (32U)
#define TMR_MEDIA_CHANNEL_GLOBAL_FBLPR_PARAM_VAL(x) (((uint32_t)(((uint32_t)(x)) << TMR_MEDIA_CHANNEL_GLOBAL_FBLPR_PARAM_VAL_SHIFT)) & TMR_MEDIA_CHANNEL_GLOBAL_FBLPR_PARAM_VAL_MASK)
/*! @} */

/*! @name TMUFSBECR - Media Clock uncorrectable fatal system bus error configuration register */
/*! @{ */

#define TMR_MEDIA_CHANNEL_GLOBAL_TMUFSBECR_RD_MASK (0x80000000U)
#define TMR_MEDIA_CHANNEL_GLOBAL_TMUFSBECR_RD_SHIFT (31U)
#define TMR_MEDIA_CHANNEL_GLOBAL_TMUFSBECR_RD_WIDTH (1U)
#define TMR_MEDIA_CHANNEL_GLOBAL_TMUFSBECR_RD(x) (((uint32_t)(((uint32_t)(x)) << TMR_MEDIA_CHANNEL_GLOBAL_TMUFSBECR_RD_SHIFT)) & TMR_MEDIA_CHANNEL_GLOBAL_TMUFSBECR_RD_MASK)
/*! @} */

/*! @name TMUFSBESR - Media Clock uncorrectable fatal system bus error status register */
/*! @{ */

#define TMR_MEDIA_CHANNEL_GLOBAL_TMUFSBESR_SB_ID_MASK (0xFU)
#define TMR_MEDIA_CHANNEL_GLOBAL_TMUFSBESR_SB_ID_SHIFT (0U)
#define TMR_MEDIA_CHANNEL_GLOBAL_TMUFSBESR_SB_ID_WIDTH (4U)
#define TMR_MEDIA_CHANNEL_GLOBAL_TMUFSBESR_SB_ID(x) (((uint32_t)(((uint32_t)(x)) << TMR_MEDIA_CHANNEL_GLOBAL_TMUFSBESR_SB_ID_SHIFT)) & TMR_MEDIA_CHANNEL_GLOBAL_TMUFSBESR_SB_ID_MASK)

#define TMR_MEDIA_CHANNEL_GLOBAL_TMUFSBESR_M_MASK (0x40000000U)
#define TMR_MEDIA_CHANNEL_GLOBAL_TMUFSBESR_M_SHIFT (30U)
#define TMR_MEDIA_CHANNEL_GLOBAL_TMUFSBESR_M_WIDTH (1U)
#define TMR_MEDIA_CHANNEL_GLOBAL_TMUFSBESR_M(x)  (((uint32_t)(((uint32_t)(x)) << TMR_MEDIA_CHANNEL_GLOBAL_TMUFSBESR_M_SHIFT)) & TMR_MEDIA_CHANNEL_GLOBAL_TMUFSBESR_M_MASK)

#define TMR_MEDIA_CHANNEL_GLOBAL_TMUFSBESR_SBE_MASK (0x80000000U)
#define TMR_MEDIA_CHANNEL_GLOBAL_TMUFSBESR_SBE_SHIFT (31U)
#define TMR_MEDIA_CHANNEL_GLOBAL_TMUFSBESR_SBE_WIDTH (1U)
#define TMR_MEDIA_CHANNEL_GLOBAL_TMUFSBESR_SBE(x) (((uint32_t)(((uint32_t)(x)) << TMR_MEDIA_CHANNEL_GLOBAL_TMUFSBESR_SBE_SHIFT)) & TMR_MEDIA_CHANNEL_GLOBAL_TMUFSBESR_SBE_MASK)
/*! @} */

/*!
 * @}
 */ /* end of group TMR_MEDIA_CHANNEL_GLOBAL_Register_Masks */

/*!
 * @}
 */ /* end of group TMR_MEDIA_CHANNEL_GLOBAL_Peripheral_Access_Layer */

#endif  /* #if !defined(S32K566_TMR_MEDIA_CHANNEL_GLOBAL_H_) */
